docs/uml/uml2/state_etudiant.puml
@startuml StateEtudiant
[*] --> Inscrit : Inscription Administrative
Inscrit --> EnAttenteEvaluation : Début des cours
EnAttenteEvaluation --> Evalue : Notes saisies

state Evalue {
  [*] --> NotePartielle
  NotePartielle --> NoteComplete : Toutes les notes saisies
}

Evalue --> Delibere : Passage en Jury

Delibere --> Admis : Crédits >= 60
Delibere --> Redoublant : Crédits < 50
Delibere --> RepriseSoutenance : 50 <= Crédits < 60 + Stage Échoué

Admis --> [*] : Diplômé
RepriseSoutenance --> Admis : Soutenance validée
@enduml
